{
    "what-exactly-is-ecs": {
    "a-en": "What exactly is ECS?",
    "a-es":"¿Qué es exactamente el ECS?",
    "en": "<p>Early College Studies is a program pathway to help you or your child receive an associates degree.</p>",
    "es": "<p>Early College Studies es una vía de programa para ayudarle a usted o a su hijo a recibir un título de asociado.</p>"
  },
    "what-does-a-typical-day-look-like-for-an-ecs-student": {
    "a-en":"What does a typical day look like for an ECS student?",
    "a-es":"¿Cómo es un día normal para un estudiante de ECS?",
    "en": "<p>The typical day for a freshman in ECS looks a lot like the day for any other freshman. Being part of this program does not excuse a student from any of the requirements for high school graduation; additionally, Norwalk Community College (NCC) does not allow students to start taking coursework until at least their sophomore year. Therefore, students attend their regularly scheduled high school courses at whatever level they have been assigned (i.e., English 9 Honors, Biology CP, etc.) by their middle school counselor.</p><p>All freshmen ECS students, however, have Workplace Learning 1, Introduction to Programming (ECS), and Web Development and Design (ECS) as courses on their schedule. These courses are counted as electives toward high school graduation requirements, but they are mandatory for participation in this program. While ECS students will find themselves “mixed in” with students who are not in the program in almost all of their classes, these three courses are only open to students in the program.</p><p>Sophomore year, students begin taking NCC courses. Stamford High School currently offers three introductory NCC computer science courses on the SHS campus during the school day. This enables sophomores to start their NCC coursework while remaining on the Stamford High School campus. Additionally, all sophomores are required to take Workplace Learning 2.</p><p>Starting junior year, students are eligible to begin taking courses directly through NCC in addition to having their year-long capstone project in Workplace Learning 3.</p>",
    "es": "<p>El día típico para un estudiante de primer año en ECS es muy similar al de cualquier otro estudiante de primer año. Ser parte de este programa no exime a un estudiante de ninguno de los requisitos para la graduación de la escuela secundaria; además, Norwalk Community College (NCC) no permite que los estudiantes comiencen a tomar cursos hasta al menos su segundo año. Por lo tanto, los estudiantes asisten a sus cursos regulares de la escuela secundaria en el nivel que les asignó el consejero de la escuela intermedia (por ejemplo, English 9 Honors, Biology CP, etc.).</p><p>Sin embargo, todos los estudiantes de primer año de ECS tienen Workplace Learning 1, Introduction to Programming (ECS) y Web Development and Design (ECS) en su horario. Estos cursos cuentan como optativos para los requisitos de graduación de la escuela secundaria, pero son obligatorios para participar en este programa. Mientras que los estudiantes de ECS “se mezclan” con estudiantes que no están en el programa en casi todas sus clases, estos tres cursos solo están disponibles para estudiantes del programa.</p><p>En el segundo año, los estudiantes comienzan a tomar cursos de NCC. Stamford High School actualmente ofrece tres cursos introductorios de ciencias de la computación de NCC en el campus de SHS durante el día escolar. Esto permite que los estudiantes de segundo año inicien su trabajo de NCC mientras permanecen en el campus de Stamford High School. Además, todos los estudiantes de segundo año deben tomar Workplace Learning 2.</p><p>A partir del tercer año, los estudiantes son elegibles para comenzar a tomar cursos directamente a través de NCC, además de tener su proyecto de culminación de año en Workplace Learning 3.</p>"
  },
  "can-i-play-sports-and-other-extracurricular-activities-in-ecs": {
    "a-en":"Can I play sports and other extracurricular activities in ECS?",
    "a-es":"¿Puedo practicar deportes y otras actividades extraescolares en ECS?",
    "en": "<p>Absolutely…and it depends. ECS students are welcome to participate in sports and other extracurricular activities. We have a significant number of students who play at least one sport throughout the year, and we also have students involved in drama club, debate, 3D printing club, coding club, band, chorus and more.</p><p>Extracurricular participation may also be determined by the student’s goals for themselves in the program. If the student is intent on completing the associate’s degree within their four years of high school, the student is going to need to make schedule-related sacrifices. Completion of both high school coursework and an associate’s degree makes for a demanding schedule. Add sports practice into the mix, or other time-consuming activities, and life could get very overwhelming and unmanageable for a student.</p>",
    "es": "<p>Absolutamente… y depende. Los estudiantes de ECS son bienvenidos a participar en deportes y otras actividades extracurriculares. Tenemos un número significativo de estudiantes que practican al menos un deporte durante todo el año, y también tenemos estudiantes involucrados en el club de teatro, debate, club de impresión 3D, club de codificación, banda, coro y más.</p><p>La participación extracurricular también puede estar determinada por las metas que el estudiante tenga para sí mismo en el programa. Si el estudiante tiene la intención de completar el título de asociado dentro de sus cuatro años de escuela secundaria, necesitará hacer sacrificios relacionados con el horario. Completar tanto el trabajo de la escuela secundaria como un título de asociado genera un horario exigente. Agregar prácticas deportivas a la mezcla, u otras actividades que consumen mucho tiempo, y la vida puede volverse muy abrumadora e inmanejable para un estudiante.</p>"
  },
  "who-can-apply-for-and-attend-ecs": {
    "a-en":"Who can apply for and attend ECS?",
    "a-es":"¿Quién puede solicitar y asistir a la ECS?",
    "en": "<p>ECS@SHS is a specialized program that is only available to Stamford Public School students. Even a Stamford student who is zoned for attendance at Westhill High School can attend Stamford High School full-time so he/she can be a part of the program if accepted. Applicants must be residents of the City of Stamford. Therefore, students in 8th grade who currently attend a school other than one associated with Stamford Public Schools may apply as long as they are residents of the city.</p>",
    "es": "<p>ECS@SHS es un programa especializado que solo está disponible para estudiantes de las Escuelas Públicas de Stamford. Incluso un estudiante de Stamford que esté zonificado para asistir a Westhill High School puede asistir a Stamford High School a tiempo completo para formar parte del programa si es aceptado. Los solicitantes deben ser residentes de la ciudad de Stamford. Por lo tanto, los estudiantes de octavo grado que actualmente asisten a una escuela no asociada con las Escuelas Públicas de Stamford pueden postularse siempre y cuando sean residentes de la ciudad.</p>"
  },
  "what-if-i-want-to-apply-to-aite": {
    "a-en":"What if I want to apply to AITE?",
    "a-es":"¿Qué pasa si quiero solicitar la AITE?",
    "en": "<p>We invite all students who are interested in applying to AITE as well to take part in our admissions process. ECS is about supporting students in their transition from high school to college and career, so this is a student’s first opportunity to gain experience with the post-secondary process. After all, the best case scenario is that one day a graduating senior student applies to multiple colleges and gets multiple acceptance letters, or a job-seeker interviews at multiple companies and receives multiple job offers! This application process should be treated the same way.</p><p>There are many reasons why a student might choose to go to AITE or to any other program held in the district. What separates ECS from other programs is that it provides students with the opportunity of pursuing and earning a degree. College degrees are the completion of a series of requirements that then make the degree-holder eligible for relevant paid work. While students can take college-level courses at any of the Stamford public high schools through AP or UConn Early College Experience courses, these courses become a collection of separate credits on a student’s resume and do not lead to a degree.</p>",
    "es": "<p>Invitamos a todos los estudiantes que estén interesados en postularse a AITE a participar también en nuestro proceso de admisión. ECS se trata de apoyar a los estudiantes en su transición de la escuela secundaria a la universidad y la carrera, por lo que esta es la primera oportunidad del estudiante para adquirir experiencia con el proceso de educación postsecundaria. Después de todo, el mejor escenario es que un día un estudiante de último año se postule a varias universidades y reciba varias cartas de aceptación, ¡o que un buscador de empleo tenga entrevistas en varias empresas y reciba varias ofertas de trabajo! Este proceso de solicitud debe ser tratado de la misma manera.</p><p>Hay muchas razones por las que un estudiante podría elegir ir a AITE o a cualquier otro programa del distrito. Lo que separa a ECS de otros programas es que brinda a los estudiantes la oportunidad de cursar y obtener un título. Los títulos universitarios son la culminación de una serie de requisitos que luego hacen que el titular del título sea elegible para trabajos remunerados relevantes. Si bien los estudiantes pueden tomar cursos a nivel universitario en cualquiera de las escuelas secundarias públicas de Stamford a través de cursos AP o UConn Early College Experience, estos cursos se convierten en una colección de créditos separados en el currículum del estudiante y no conducen a un título.</p>"
  },
  "what-happens-if-i-am-placed-on-the-lottery-waiting-list": {
    "a-en":"What happens if I am placed on the lottery waiting list?",
    "a-es":"¿Qué ocurre si me inscriben en la lista de espera de la lotería?",
    "en": "<p>Each student placed on the waiting list is provided a number to let them know what spot they are on this list. If an accepted student decides not to enter the program, their spot is offered to the person next in line on the waiting list until it is filled.</p>",
    "es": "<p>A cada estudiante colocado en la lista de espera se le asigna un número para indicar su posición en esta lista. Si un estudiante aceptado decide no ingresar al programa, su lugar se ofrece a la siguiente persona en la lista de espera hasta que se llene.</p>"
  },
  "why-is-it-beneficial-to-attend-this-type-of-school": {
    "a-en":"Why is it beneficial to attend this type of school?",
    "a-es":"¿Por qué es beneficioso asistir a este tipo de escuela?",
    "en": "<p>The world and the job market are changing. Today’s jobs especially require more technology-based skills. Many positions require less than a four-year degree, but more than a high school diploma. According to projections by the <a href='https://cew.georgetown.edu/wp-content/uploads/2014/11/Recovery2020.ES_.Web_.pdf'>Center on Education and the Workforce at Georgetown University</a>, “65% of all jobs in the economy will require postsecondary education and training beyond high school.” On average, workers with an associate’s degree will earn 73% more than those with only a high school diploma.</p><p>ECS@SHS allows students who may not have thought about college, or who may be the first in their family to consider it, or who may not be able to afford college, to earn an associate degree and a real opportunity at a good job after graduating. With a high school diploma and associate degree at graduation, they are prepared to join the workforce, or continue on to earn a four-year or advanced degree.</p>",
    "es": "<p>El mundo y el mercado laboral están cambiando. Hoy en día, los empleos requieren especialmente más habilidades basadas en la tecnología. Muchos puestos requieren menos de un título de cuatro años, pero más que un diploma de secundaria. Según proyecciones del <a href='https://cew.georgetown.edu/wp-content/uploads/2014/11/Recovery2020.ES_.Web_.pdf'>Center on Education and the Workforce de la Universidad de Georgetown</a>, “el 65% de todos los empleos en la economía requerirán educación y capacitación postsecundaria más allá de la escuela secundaria.” En promedio, los trabajadores con un título de asociado ganarán un 73% más que aquellos con solo un diploma de secundaria.</p><p>ECS@SHS permite a los estudiantes que quizás no hayan pensado en la universidad, o que puedan ser los primeros en su familia en considerarla, o que tal vez no puedan pagar la universidad, obtener un título de asociado y una oportunidad real de un buen trabajo después de graduarse. Con un diploma de secundaria y un título de asociado al graduarse, están preparados para incorporarse a la fuerza laboral o continuar para obtener un título de cuatro años o avanzado.</p>"
  },
  "what-coursework-is-offered-through-the-ncc-degree-program": {
    "a-en":"What coursework is offered through the NCC degree program?",
    "a-es":"¿Qué cursos se ofrecen en el programa de grado NCC?",
    "en": "<p>Students have the option of three degree-tracks, focusing on either mobile programming, software engineering, or website development and design. You can find a list of courses required for each degree track by <a href='about.html#degrees'>clicking here</a>.</p>",
    "es": "<p>Los estudiantes tienen la opción de tres itinerarios de grado, centrados en programación móvil, ingeniería de software o desarrollo y diseño de sitios web. Puedes encontrar una lista de los cursos requeridos para cada itinerario de grado haciendo <a href='about.html#degrees'>clic aquí</a>.</p>"
  },
  "what-kind-of-jobs-can-students-get-after-graduating": {
    "a-en":"What kinds of jobs can students get after graduating?",
    "a-es":"¿Qué tipo de trabajos pueden conseguir los estudiantes después de graduarse?",
    "en": "<p>Students who earn one of the AAS degrees are prepared for entry level careers in computer programming, database programming and administration, and web development. Students also get a foundation in the field of computer systems that will let them transition into a Bachelor of Technology in Computer Systems program, if they desire. Furthermore, these AAS options prepare competent technicians who have the skills needed by the computer industry. Graduates qualify for occupations such as field engineer, computer-repair technician, business machines technician, data processing equipment specialist, electromechanical technician, laboratory technician, production assembly technician, biomedical instruments service technician, and robotics service technician. Manufacturers and users of computers and electromechanical equipment are potential employers.</p>",
    "es": "<p>Los estudiantes que obtienen uno de los títulos AAS están preparados para carreras de nivel inicial en programación de computadoras, programación y administración de bases de datos y desarrollo web. Los estudiantes también adquieren una base en el campo de los sistemas informáticos que les permitirá pasar a un programa de Licenciatura en Tecnología en Sistemas Informáticos, si así lo desean. Además, estas opciones de AAS preparan a técnicos competentes que tienen las habilidades necesarias para la industria informática. Los graduados califican para ocupaciones como ingeniero de campo, técnico en reparación de computadoras, técnico en máquinas de oficina, especialista en equipos de procesamiento de datos, técnico electromecánico, técnico de laboratorio, técnico de ensamblaje de producción, técnico de servicio de instrumentos biomédicos y técnico de servicio de robótica. Los fabricantes y usuarios de computadoras y equipos electromecánicos son posibles empleadores.</p>"
  },
  "do-norwalk-community-college-credits-transfer-to-other-schools": {
    "a-en":"Do Norwalk Community College credits transfer to other schools?",
    "a-es": "¿Se transfieren los créditos del Norwalk Community College a otras escuelas?",
    "en": "<p>Norwalk Community College does not guarantee that all of their credits can or will transfer to every school, college, or university in the nation. Any decision on the comparability, appropriateness and applicability of credit and whether credit should be accepted is the decision of the receiving institution.</p><p>As students begin to research colleges and apply, they should connect with an admissions counselor at each school to find out what courses could transfer to the school.</p>",
    "es": "<p>Norwalk Community College no garantiza que todos sus créditos puedan o se transferirán a cada escuela, colegio o universidad del país. Cualquier decisión sobre la comparabilidad, idoneidad y aplicabilidad de los créditos y si deben ser aceptados es decisión de la institución receptora.</p><p>Cuando los estudiantes comiencen a investigar universidades y a postularse, deben conectarse con un consejero de admisiones en cada institución para averiguar qué cursos podrían transferirse a esa escuela.</p>"
  },
  "how-is-the-students-college-level-coursework-funded": {
    "a-en":"How are the students' college level coursework funded?",
    "a-es":"¿Cómo se financian los cursos de nivel universitario de los estudiantes?",
    "en": "<p>There are a number of opportunities for students to get coursework funded. First, with our partnership with NCC, Juniors and Seniors are eligible to have two courses per semester (Fall and Spring) be covered via the high school partnership program. In addition to this, SHS offers a number of NCC courses on the SHS campus which students do not have to pay for. Students can also utilize AP and UConn ECE courses to fulfill some of their NCC degree coursework. Also, ECS will continue to hire NCC adjunct faculty to teach summer courses that will be offered at no charge to the students. Lastly, any courses not covered via these means, students are eligible to fill out the FAFSA application in order to determine financial aid, just like they would have done entering college after high school graduation. Anything above and beyond these resources are the responsibility of the student.</p>",
    "es": "<p>Existen varias oportunidades para que los estudiantes obtengan financiamiento para sus cursos. Primero, con nuestra asociación con NCC, los estudiantes de tercer y cuarto año son elegibles para que dos cursos por semestre (otoño y primavera) sean cubiertos a través del programa de asociación con la escuela secundaria. Además de esto, SHS ofrece una serie de cursos de NCC en el campus de SHS que los estudiantes no tienen que pagar. Los estudiantes también pueden utilizar cursos AP y UConn ECE para cumplir con algunos de sus cursos de grado de NCC. Además, ECS continuará contratando profesores adjuntos de NCC para impartir cursos de verano que se ofrecerán sin costo para los estudiantes. Por último, para cualquier curso no cubierto a través de estos medios, los estudiantes son elegibles para completar la solicitud FAFSA para determinar la ayuda financiera, tal como lo harían al ingresar a la universidad después de la graduación de la escuela secundaria. Cualquier cosa que exceda estos recursos es responsabilidad del estudiante.</p>"
  }
}